crm/app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.all
---
SELECT * FROM `contracts`

  def show
    @contract = Contract.find(params[:id])
---
SELECT * FROM `contracts` WHERE (`contracts`.`id` = 1)

  def edit
    @contract = Contract.find(params[:id])
---
SELECT * FROM `contracts` WHERE (`contracts`.`id` = 1)

  def create
    @contract = Contract.new(params[:contract])

    respond_to do |format|
      if @contract.save
---
INSERT INTO `contracts` (`name`, `created_at`, `code`, `ended_at`, `project_id`, `updated_at`, `value`, `description`, `started_at`, `status`, `leader_id`) VALUES('Contrato', '2011-02-13 15:52:26', '1', '2011-02-13 00:00:00', 6, '2011-02-13 15:52:26', 3000.0, 'descricao', '2011-02-13 00:00:00', 'prospecting', 1)

  def load_users
    @users = User.all.collect { |u| [u.name, u.id] }
---
SELECT * FROM `users`

  def load_projects
    @projects = Project.all.collect { |p| [p.name, p.id] }
---
SELECT `projects`.id FROM `projects` WHERE (`projects`.`name` = BINARY 'Nome do Projeto' AND `projects`.id <> 1) LIMIT 1