crm/app/controllers/customers_controller.rb

SELECT * FROM `customers`
---
  def index
    @customers = Customer.all

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def show
    @customer = Customer.find(params[:id])

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
---
  def edit
    @customer = Customer.find(params[:id])

INSERT INTO `customers` (`name`, `rating`, `created_at`, `phone_country_code`, `updated_at`, `phone_area_code`, `phone_number`, `description`) VALUES('flavio', '1', '2011-02-20 18:41:09', 1, '2011-02-20 18:41:09', 1, '1234567890', 'descricao')
---
  def create
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
UPDATE `customers` SET `phone_area_code` = 98, `updated_at` = '2011-02-20 19:49:25', `phone_country_code` = 89, `phone_number` = '0909' WHERE `id` = 9
---
  def update
    @customer = Customer.find(params[:id])

    respond_to do |format|
      if @customer.update_attributes(params[:customer])

SELECT * FROM `customers` WHERE (`customers`.`id` = 1)
DELETE FROM `customers` WHERE `id` = 1
---
  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy