crm/app/controllers/documents_controller.rb

SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.project_id = 6))
---
  def show
    @document = @project.documents.find(params[:id])

SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.project_id = 6))
---
  def edit
    @document = @project.documents.find(params[:id])

INSERT INTO `documents` (`created_at`, `title`, `document_file_size`, `project_id`, `updated_at`, `document_file_name`, `document_updated_at`, `description`, `document_content_type`) VALUES('2011-03-05 21:29:09', 'Titulo Documento', 239742, 6, '2011-03-05 21:29:09', 'HD-0008.jpg', '2011-03-05 21:29:08', 'Descricao Documento', 'image/jpeg')
---
  def create
    @document = @project.documents.build(params[:document])

    respond_to do |format|
      if @document.save

SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.project_id = 6))
UPDATE `documents` SET `updated_at` = '2011-03-05 21:32:37', `document_file_name` = 'Relatorio de Estgio Luiz Junior.doc', `document_file_size` = 61440, `document_updated_at` = '2011-03-05 21:32:37', `document_content_type` = 'application/msword' WHERE `id` = 1
---
  def update
    @document = @project.documents.find(params[:id])

    respond_to do |format|
      if @document.update_attributes(params[:document])

SELECT * FROM `documents` WHERE (`documents`.`id` = 1 AND (`documents`.project_id = 6))
DELETE FROM `documents` WHERE `id` = 1
---
  def destroy
    @document = @project.documents.find(params[:id])
    @document.destroy

SELECT * FROM `projects` WHERE (`projects`.`id` = 6)
SELECT `documents`.* FROM `documents` WHERE (`documents`.project_id = 6)
---
  def load_project
    @project = Project.find(params[:project_id], :include => :documents)