crm/app/controllers/home_controller.rb

  def finish
    @task = current_user.tasks.find(params[:id].gsub(/\D/, ""))
    #@task = current_user.tasks.find(params[:id])
    @task.update_attribute("status", "closed")
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1 AND (`tasks`.owner_id = 10))
UPDATE `tasks` SET `updated_at` = '2011-03-06 19:59:20', `status` = 'closed' WHERE `id` = 1

  def save
    @task = Task.new(params[:task].merge({ :status => "open" }))
    @task.owner = current_user
    @task.save
---
INSERT INTO `tasks` (`created_at`, `title`, `ended_at`, `project_id`, `updated_at`, `priority`, `progress`, `owner_id`, `description`, `started_at`, `status`) VALUES('2011-03-08 18:07:21', 'tarefa ajax', NULL, 1, '2011-03-08 18:07:21', 'normal', 18, 10, 'Descricao', NULL, 'open')

  def load_items
    @projects = Project.find(:all).collect { |p| [p.name, p.id] }
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)