crm/app/controllers/projects_controller.rb

SELECT * FROM `projects` ORDER BY projects.name
---
  def index
    #@projects = Project.all(:include => [:customer], :order =>"customers.name")
    @projects = Project.paginate :page => params[:page], :include => [:customer], :order =>"customers.name" , :per_page => 4

INSERT INTO `projects` (`name`, `created_at`, `updated_at`, `description`, `customer_id`, `active`) VALUES('Projeto 1', '2011-03-02 00:37:33', '2011-03-02 00:37:33', 'Descricao do projeto 1', 1, NULL)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
UPDATE `projects` SET `updated_at` = '2011-02-13 15:40:30', `description` = 'Descrcao do projeto 1' WHERE `id` = 6
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT `customers`.id FROM `customers` WHERE (`customers`.`name` = BINARY 'New Company, Inc' AND `customers`.id <> 3) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = '10') LIMIT 1
---
  def load_customers_and_users
    @customers = Customer.all.collect { |c| [c.name, c.id] }
    @users = User.find(:all, :order => "name")