crm/app/controllers/tasks_controller.rb

  def index
    @tasks = Task.paginate :page => params[:page], :order => 'title ASC', :per_page => 4
---
SELECT * FROM `tasks`

  def show
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`created_at`, `title`, `ended_at`, `project_id`, `updated_at`, `priority`, `progress`, `owner_id`, `description`, `started_at`, `status`) VALUES('2011-02-13 15:57:54', 'Task', '2011-02-13 00:00:00', 7, '2011-02-13 15:57:54', 'normal', 30, 1, 'description', '2011-02-13 00:00:00', 'open')

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
UPDATE `tasks` SET `updated_at` = '2011-02-20 20:18:39', `title` = 'Task atualizada log' WHERE `id` = 1

  def load_users
    @users = User.all.collect { |u| [u.name, u.id] }
---
SELECT * FROM `users`

  def load_projects
    @projects = Project.all.collect { |p| [p.name, p.id] }
---
SELECT `projects`.id FROM `projects` WHERE (`projects`.`name` = BINARY 'Project 2' AND `projects`.id <> 7) LIMIT 1