crm/app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.paginate :page => params[:page],
      :conditions => ["id <> ? ", "#{current_user.id}"],
      :order => 'name ASC', :per_page => 4

INSERT INTO `users` (`name`, `kind`, `created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('flavio roberto', 'administrator', '2011-03-05 23:16:21', '8a7cc8272661eb15ad63db43cc963173a941397a250b86bda64f5467892395f8563b0ed7d81695bff0a0438f143accdf004c77c35eb3d9a79a10d235a5534a74', '2011-03-05 23:16:21', 'flavioax', 'lZoTWHsXI0i6hkRi4YEd', '22390c8f804ed373d1fefa12217a024c3d35f09cacda88f93b96964b9048d18e965c3770afab0a0da7b4e5e288bddc50eb7b307e37433af12ca3423a25857dd4', 'flavioapolinario@hotmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '10') LIMIT 1
---
  def edit
    #@user = current_user
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '10') LIMIT 1
UPDATE `users` SET `updated_at` = '2011-03-06 18:24:06', `username` = 'teste3' WHERE `id` = 12
---
  def update
    #@user = current_user
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])